MESSAGES = {
    "menu": (
        "\nМеню:\n"
        "1. Добавить книгу\n"
        "2. Удалить книгу\n"
        "3. Найти книгу\n"
        "4. Отобразить все книги\n"
        "5. Изменить статус книги\n"
        "6. Выход\n"
    ),
    "add_prompt_title": "\nВведите название книги: ",
    "add_prompt_author": "Введите автора книги: ",
    "add_prompt_year": "Введите год выпуска книги: ",
    "add_success": "\nКнига успешно добавлена.",
    "prompt_id": "\nВведите ID книги: ",
    "delete_success": "\nКнига успешно удалена.",
    "search_prompt": "\nВведите название, автора или год выпуска книги: ",
    "search_not_found": "\nКнига не найдена.",
    "no_books": "\nКниг в библиотеке нет.",
    "status_prompt_new": "Введите новый статус книги (В наличии или Выдана): ",
    "status_success": "\nСтатус книги успешно изменён.",
    "input_error": "Некорректный ввод. Попробуйте снова.",
    "exit": "Выход из программы.",
    "add_year_error": "Введите год выпуска корректно (только цифры).",
    "status_id_error": "Введите ID корректно (только цифры).",
    "year_error": "Введите год выпуска корректно (C 868 по 2024 год).",
    "status_invalid": "\nВведите корректный статус (В наличии или Выдана).",
}
